ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV146/ESP32_WordClockV146.ino
    case '$':                                                                                 // Fire display
      FireDisplay = 1 - FireDisplay;
      snprintf(sptext, sizeof(sptext), "FireDisplay: %s", FireDisplay ? "On" : "Off");
      ClearScreen();
      Displaytime();
      break;
      
    case '%':                                                                                 // LED strip type
      if(len == 1) 
       {
        Mem.LEDstrip = 1 - Mem.LEDstrip;
        snprintf(sptext, sizeof(sptext), "LED strip is %s after restart", Mem.LEDstrip ? "WS2812" : "SK6812");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault . ****");
      break;

     case '^':                                                                                 // *** Empty ***
      if(len == 1) 
       {
       // snprintf(sptext, sizeof(sptext), "--- %s ---", Mem.ByteFutureX ? "OFF" : "ON");
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault . ****");
      break;

    case '&':                                                                                 // Force NTP update
      if(len == 1) 
       {
        if(GetNTPtime(false))  SetDS3231Time();                                               // Only set time in DS3231 if time is valid
        SetRTCTime();
        PrintAllClockTimes();
        sptext[0] =0 ;
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault &. ****");
      break;
      
    case '(':  
      Mem.EdSoftLEDSOn = !Mem.EdSoftLEDSOn;
      snprintf(sptext, sizeof(sptext), "EDSOFT is %s", Mem.EdSoftLEDSOn ? "ON" : "OFF");
      lastminute = 99;                                                                        // Force a minute update
      break;

    case ')':
      Mem.HetIsWasOff = !Mem.HetIsWasOff;
      snprintf(sptext, sizeof(sptext), "HET IS WAS is %s", Mem.HetIsWasOff ? "OFF" : "ON");
      lastminute = 99;                                                                        // Force a minute update
      break;

    case '{':  
      if (Mem.UseRotary==3 || Mem.UseRotary==4)
       {
         StartIRLearning();                                                                   // Initializes learning mode,Resets all button data, Prompts for first button
         snprintf(sptext, sizeof(sptext), "Learning IR started");
       }
      else snprintf(sptext, sizeof(sptext), "IR remote is OFF (Turn it on with H03 or H04 )\nOr no IR remote is installed");
      break;

    case '}':                                                                                 // *** Empty ***
      if(len == 1) 
       {
       // snprintf(sptext, sizeof(sptext), "--- %s ---", Mem.ByteFutureX ? "OFF" : "ON");
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault . ****");
      break;

    case '~':
      if(len == 1) 
       {
        if (Mem.RandomDisplay > 0) Mem.RandomDisplay = 0;
        else                       Mem.RandomDisplay = 1;
       }
      if(len == 2) 
       {
        byte ff = (byte)InputString.substring(1, 2).toInt();
        if (ff < 3) Mem.RandomDisplay = ff;
       }
      Mem.DisplayChoice = DEFAULTCOLOUR;
      snprintf(sptext, sizeof(sptext), "Random display is %s", Mem.RandomDisplay==1 ? "ON/min" : Mem.RandomDisplay==2 ? "ON/hour" : "OFF");
      break;

    case '+':                                                                                 // BLE string toggle
      if(len == 1) 
       {
        Mem.UseBLELongString = 1 - Mem.UseBLELongString;
        snprintf(sptext, sizeof(sptext), "Fast BLE is %s", Mem.UseBLELongString ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter + ****");
      break;
      
    case '_':                                                                                 // Store in flash
      if(len > 1 && len < 4) 
       {
        byte ff = (byte)InputString.substring(1, 3).toInt();
        snprintf(sptext, sizeof(sptext), "No use: %d", ff);
        Tekstprintln(sptext);
       }
      break;

    case '=':                                                                                 // Print permanent Mem memory
      if(len == 1)  PrintMem(); 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter = ****");
      break;     

    case '0': 
    case '1': 
    case '2':                                                             // Time entry compatibility mode
      if(len == 6)                                                        // The first digit of InputString is 0, 1 or 2
       {
        timeinfo.tm_hour = (int)SConstrainInt(InputString, 0, 2, 0, 23);
        timeinfo.tm_min  = (int)SConstrainInt(InputString, 2, 4, 0, 59);
        timeinfo.tm_sec  = (int)SConstrainInt(InputString, 4, 6, 0, 59);
        if(DS3231Installed)   SetDS3231Time();
        else snprintf(sptext, sizeof(sptext), "No external RTC module detected");
       }   
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter Thhmmss ****");
      break;
  }
  Tekstprintln(sptext);
  StoreStructInFlashMemory();                                                                 // Update EEPROM
 }
InputString = "";
lastminute = 99;                                                                              // Force a minute update
}
//--------------------------------------------                                                //
// COMMON Print Display choice
// Default print the text
//--------------------------------------------
void PrintDisplayChoice() {PrintDisplayChoice(true);}
void PrintDisplayChoice(bool PrintIt)
{
 byte dp = Mem.DisplayChoice;
 if (dp>9) dp=9;
 snprintf(sptext, sizeof(sptext),"Display choice: %s",
        dp==0?"Yellow+":dp==1?"Hourly":dp==2?"White"  :dp==3?"All Own":
        dp==4?"Own+"   :dp==5?"Wheel" :dp==6?"Digital":dp==7?"Hourly+":
        dp==8?"Rainbow":      "NOP");        
 if (PrintIt) Tekstprintln(sptext);
}
//--------------------------------------------                                                //
// COMMON Print time input method
// Rotary, Membrane or IR-remote
//--------------------------------------------
void PrintTimeInputMethod(byte Im)
{
  char Method[20];
  switch(Im)
  {
    case 0: strcpy(Method, "None");            break;
    case 1: strcpy(Method, "Rotary");          break;
    case 2: strcpy(Method, "Membrane");        break;
    case 3: strcpy(Method, "Large IR-remote"); break;
    case 4: strcpy(Method, "Tiny Ir-remote");  break;     
   default: strcpy(Method, "Error");
  }
  snprintf(sptext, sizeof(sptext), "Time inputMethod: %s", Method);
  Tekstprintln(sptext);
}
//--------------------------------------------                                                //
// COMMON Print permanent Mem memory
//--------------------------------------------
void PrintMem(void)
{
 PrintAllMappings();                                                                          // Print the IR remote keys 
 PrintDisplayChoice();
 snprintf(sptext, sizeof(sptext)," TurnOffLEDsAtHH: %d",Mem.TurnOffLEDsAtHH);                Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"  TurnOnLEDsAtHH: %d",Mem.TurnOnLEDsAtHH);                 Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"  LanguageChoice: %d",Mem.LanguageChoice);                 Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"    LightReducer: %d",Mem.LightReducer);                   Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext)," LowerBrightness: %d",Mem.LowerBrightness);                Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext)," UpperBrightness: %d",Mem.UpperBrightness);                Tekstprintln(sptext);
 for (int i=0;i<12;i++) { snprintf(sptext, sizeof(sptext),"%03d ",Mem.NVRAMmem[i]);          Tekstprint(sptext); }   Tekstprintln("");
 for (int i=12;i<24;i++){ snprintf(sptext, sizeof(sptext),"%03d ",Mem.NVRAMmem[i]);          Tekstprint(sptext); }   Tekstprintln("");
 snprintf(sptext, sizeof(sptext),"   DisplayChoice: %d",Mem.DisplayChoice);                  Tekstprintln(sptext);                                                                   
 snprintf(sptext, sizeof(sptext),"           BLEOn: %s",Mem.BLEOn ? "ON" : "OFF");           Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"           NTPOn: %s",Mem.NTPOn ? "ON" : "OFF");           Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"          WIFIOn: %s",Mem.WIFIOn ? "ON" : "OFF");          Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"     StatusLEDOn: %s",Mem.StatusLEDOn ? "ON" : "OFF");     Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"    MCUrestarted: %d",Mem.MCUrestarted );                  Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"    LoopRebooted: %d",Mem.LoopRebooted );                  Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"     ByteFuture1: %d",Mem.ByteFuture1 );                    Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"     ByteFuture2: %d",Mem.ByteFuture2 );                    Tekstprintln(sptext); 
 snprintf(sptext, sizeof(sptext),"         DCF77On: %s",Mem.DCF77On  ? "ON" : "OFF");        Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"       UseRotary: %d",Mem.UseRotary);                      Tekstprintln(sptext);
 PrintTimeInputMethod(Mem.UseRotary);
 snprintf(sptext, sizeof(sptext),"       UseDS3231: %s",Mem.UseDS3231 ? "ON" : "OFF");       Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"       LED strip: %s", Mem.LEDstrip?"WS2812":"SK6812" );   Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"      FiboChrono: %s",Mem.FiboChrono ? "FIBO" : "CHRONO"); Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"          NoExUl: %s", Mem.NoExUl ? "ON" : "OFF");         Tekstprintln(sptext);
 byte wc = Mem.WIFIcredentials; 
 snprintf(sptext, sizeof(sptext)," WIFIcredentials: %s", wc==0? "Not SET" : wc==1? "SET" : wc==2? "SET&OK": 
                                   wc==3? "in AP not SET":"Unknown code");  Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"      IntFuture2: %d",Mem.IntFuture2 );                    Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"      IntFuture3: %d",Mem.IntFuture3 );                    Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"      HET IS WAS: %s", Mem.HetIsWasOff ? "OFF" : "ON");    Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"       EDSOFT is: %s", Mem.EdSoftLEDSOn ? "ON" : "OFF");   Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"   RandomDisplay: %s", Mem.RandomDisplay? "ON" : "OFF");   Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"WIFInoConnection: %d", Mem.WIFInoConnection);              Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"UseBLELongString: %s",Mem.UseBLELongString?"ON":"OFF");    Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"     Font colour: 0X%08" PRIX32, Mem.OwnColour);           Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"    DimmedLetter: 0X%08" PRIX32,Mem.DimmedLetter);         Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"      BackGround: 0X%08" PRIX32,Mem.BackGround);           Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"            SSID: %s",Mem.SSID);                           Tekstprintln(sptext);
 // snprintf(sptext, sizeof(sptext),"BackGround: %s",Mem.Password);                          Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"BLEbroadcastName: %s",Mem.BLEbroadcastName);               Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"        Timezone: %s",Mem.Timezone);                       Tekstprintln(sptext);
 snprintf(sptext, sizeof(sptext),"        Checksum: %d",Mem.Checksum);                       Tekstprintln(sptext);
 sptext[0]=0;                                                                                 // Suppress a second print of sptext
}
//--------------------------------------------                                                //
// LDR reading are between 0 and 255. 
// ESP32 analogue read is between 0 - 4096 --   is: 4096 / 8
//--------------------------------------------
int ReadLDR(void)
{
 return analogRead(PhotoCellPin)/16;
}

//--------------------------------------------                                                //
//  CLOCK Set second colour
//  Set the colour per second of 'IS' and 'WAS'
//---------------------------------------------
void SetSecondColour(void)
{
                             #ifdef FOURLANGUAGECLOCK
  return;                                                                                     // 4-language clock uses SetColours() once per minute
                             #endif  //FOURLANGUAGECLOCK    
 static byte kleur = 0;                                                                      //  color increases per second in RAINBOW
 MINColor = FuncCRGBW(15 + timeinfo.tm_min * 4, 255 - timeinfo.tm_min * 4, 0, 0); 
 SECColor = FuncCRGBW(15 + timeinfo.tm_sec * 4, 255 - timeinfo.tm_sec * 4, 0, 0 );   
                                                                                              // Light up  IS or WAS with the proper colour  
 switch (Mem.DisplayChoice)
  {
   case DEFAULTCOLOUR: LetterColor = DefaultColor;                                     break; // Yellow text with changing MIN and SEC  
   case HOURLYCOLOUR : LetterColor = MINColor = SECColor = HourColor[timeinfo.tm_hour];break; // A colour every hour, not changing MIN and SEC
   case WHITECOLOR   : LetterColor = MINColor = SECColor = white;                      break; // All white
   case OWNCOLOUR    : LetterColor = MINColor = SECColor = Mem.OwnColour;              break; // Own colour
   case OWNHETISWAS  : LetterColor = Mem.OwnColour;                                    break; // Own colour except HET IS WAS  
   case WHEELCOLOR   : LetterColor = MINColor = SECColor = Wheel((timeinfo.tm_min*4)); break; // Colour of all letters changes per minute
   case DIGITAL      : MINColor = SECColor = 0;                                        break; // Digital display of time. No IS WAS turn color off in display
   case HOURHETISWAS : LetterColor = HourColor[timeinfo.tm_hour];                      break; // A colour every hour changing MIN and SEC
   case RAINBOW      : LetterColor = MINColor = SECColor = Wheel(kleur++);             break; // Colour of all letters changes per second 
  }
 if(Mem.HetIsWasOff){MINColor = SECColor = 0;}                                                // If HET IS WAS is turned off in menu with Q9
 NoTextInLeds  = true;                                                                        // Flag to control printing of the text IS en WAS in serial
                    #ifdef DE144CLOCK  
 if(Is) {IST;} else {WAR;}                      
                    #endif  //DE144CLOCK                      
 if(Is) {IS;}  else {WAS;} 
 if (Mem.DisplayChoice == RAINBOW ) Displaytime();                                            // Now we have to send the time to the display every second 
 NoTextInLeds  = false;                                                                       // Flag to control printing of the text IS en WAS in serial
 ShowLeds();                                                                                  // Updating IS and WAS with ShowLeds is done here to avoid updating all letters every second with Displaytime function
 
 // Serial.print("   SecColor: ");    Serial.println(SECColor,HEX);  
 // Serial.print("   MinColor: ");    Serial.println(MINColor,HEX);  
 // Serial.print("LetterColor: ");    Serial.println(LetterColor,HEX);         
}

