ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV146/ESP32_WordClockV146.ino
//--------------------------------------------                                                //
// LOGBUFFER Initialize circular logging buffer      
//--------------------------------------------
void InitLogBuffer()
{
 size_t heap = ESP.getFreeHeap();                                                                                   // Current free heap
 if (heap > 20000) LogBufferSize = heap - 10000;                                                                    // Keep 10k reserved
 else LogBufferSize = heap / 2;                                                                                     // Fallback
 LogBuffer = (char*)malloc(LogBufferSize);                                                                          // Allocate single buffer
 if (!LogBuffer)
   {
    Tekstprintln("ERROR: Could not allocate log buffer");                                                        //
    return;                                                                                                        //
   }
 memset(LogBuffer, 0, LogBufferSize);                                                                               // Clear buffer
 LogWritePos = 0;                                                                                                   //
 LogWrapped  = false;       
 snprintf(sptext, sizeof(sptext)," Log buffer allocated: %u bytes", (unsigned) LogBufferSize);                                                                                     //
 Tekstprintln(sptext);                                                                          //
}

//--------------------------------------------                                                //
// LOGBUFFER Add a log line (raw C-string). Always ends with '\n'.
//--------------------------------------------
void AddLog(const char* msg)
{
 if (!LogBuffer) return;
 size_t len = strlen(msg);
 if (len >= LogBufferSize)
    {
     msg += (len - LogBufferSize);  // keep only last part
     len = strlen(msg);
    }
    for (size_t i = 0; i < len; i++)
    {
     LogBuffer[LogWritePos++] = msg[i];
     if (LogWritePos >= LogBufferSize)
        {
         LogWritePos = 0;
         LogWrapped  = true;
        }
    }
}

//--------------------------------------------                                                //
// LOGBUFFER Stream the last 500 lines circular log buffer directly to the client                                 //
//--------------------------------------------
void HandleTekstPrint(AsyncWebServerRequest *request)
{
 if (!LogBuffer)
   {
     request->send(200, "text/plain", "Log buffer uninitialized\n");
     return;
   }
 AsyncResponseStream *response = request->beginResponseStream("text/plain");
 size_t lineCount = 0;
 ssize_t pos = LogWritePos;
 for (size_t scanned = 0; scanned < LogBufferSize && lineCount < 500; scanned++)              // Count lines backwards to find last 500 '\n's
    {
     pos = (pos == 0) ? LogBufferSize - 1 : pos - 1;
     if (LogBuffer[pos] == '\n') lineCount++;
     if (!LogWrapped && pos == 0) break;                                                      // Stop if buffer not wrapped
    }
   size_t start = (pos + 1) % LogBufferSize;                                                  // Now pos points to the start of the 500th-last line (or beginning)
 if (!LogWrapped || start < LogWritePos)                                                      // Stream lines from start → end of buffer
   {
    response->write(LogBuffer + start, LogWritePos - start);
   }
 else
   {
    response->write(LogBuffer + start, LogBufferSize - start);                               // Wrap: first part from start → end of buffer
    response->write(LogBuffer, LogWritePos);                                                 // second part from 0 → write pos
   }
 request->send(response);
}

//--------------------------------------------                                                //
// LOGBUFFER Stream all the circular log buffer directly to the client                                      //
//--------------------------------------------
void HandleTekstDownload(AsyncWebServerRequest *request)
{
 if (!LogBuffer)
   {
    request->send(200, "text/plain", "Log buffer uninitialized\n");
    return;
   }
 AsyncResponseStream *response = request->beginResponseStream("text/plain");
 if (!LogWrapped)     response->write(LogBuffer, LogWritePos);
 else
   {
    size_t tail = LogBufferSize - LogWritePos;
    response->write(LogBuffer + LogWritePos, tail);
    response->write(LogBuffer, LogWritePos);
   }
    request->send(response);
}

/// ringbuffer
//--------------------------------------------                                                //
// Print memory space
//--------------------------------------------
void printHeaps(void)
{
    Tekstprintf("8-bit capable heap: %u bytes\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
    Tekstprintf(" DMA  capable heap: %u bytes\n", heap_caps_get_free_size(MALLOC_CAP_DMA));
    Tekstprintf("       SPIRAM heap: %u bytes\n", heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
}